import s from './Chatbots.module.scss';
import iphone from '../../assets/img/iphone.png';
import oneplus from '../../assets/img/oneplus.png';

const Chatbots = () => {
    return (
        <div className={s.card__content}>
            <h2 className={s.card__title}>
                Расписание всегда с тобой
            </h2>
            <p className={s.card__descr}>
                Сервисы онлайн расписания
            </p>
            <ul className={s.card__list}>
                <li className={s.card__item}>
                    <svg width="64" height="64" viewBox="0 0 84 84" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M42 84C65.196 84 84 65.196 84 42C84 18.804 65.196 0 42 0C18.804 0 0 18.804 0 42C0 65.196 18.804 84 42 84Z"
                            fill="#4D76A1"/>
                        <path fillRule="evenodd" clipRule="evenodd"
                              d="M40.4135 60.4208H43.71C43.71 60.4208 44.7058 60.3115 45.2141 59.7634C45.6821 59.2603 45.6671 58.3155 45.6671 58.3155C45.6671 58.3155 45.6027 53.8922 47.6556 53.2408C49.6793 52.5992 52.278 57.5159 55.0324 59.4063C57.1153 60.837 58.698 60.5233 58.698 60.5233L66.0629 60.4208C66.0629 60.4208 69.9157 60.1834 68.0888 57.1542C67.9391 56.9064 67.025 54.9134 62.6129 50.8181C57.995 46.5318 58.6134 47.2251 64.1762 39.8108C67.564 35.2955 68.9184 32.5388 68.4954 31.3581C68.0918 30.2336 65.6002 30.5308 65.6002 30.5308L57.3077 30.5825C57.3077 30.5825 56.693 30.4986 56.2371 30.7712C55.7916 31.0385 55.5049 31.6614 55.5049 31.6614C55.5049 31.6614 54.1924 35.1555 52.442 38.127C48.7494 44.3973 47.273 44.7282 46.6696 44.3389C45.2658 43.4315 45.6162 40.6936 45.6162 38.7485C45.6162 32.6721 46.5378 30.1385 43.8216 29.4827C42.9201 29.2648 42.2568 29.1211 39.9516 29.0978C36.9928 29.0672 34.4884 29.1068 33.0704 29.8016C32.127 30.2636 31.3993 31.293 31.8425 31.3522C32.3906 31.4255 33.6319 31.6868 34.29 32.583C35.1398 33.739 35.1098 36.3354 35.1098 36.3354C35.1098 36.3354 35.598 43.4884 33.9696 44.3771C32.8518 44.9865 31.3184 43.7422 28.0265 38.0537C26.3397 35.1398 25.0661 31.9189 25.0661 31.9189C25.0661 31.9189 24.8206 31.317 24.3826 30.995C23.851 30.605 23.1083 30.4807 23.1083 30.4807L15.2284 30.5323C15.2284 30.5323 14.0454 30.5653 13.6112 31.0796C13.2249 31.5371 13.5805 32.4834 13.5805 32.4834C13.5805 32.4834 19.7497 46.9167 26.735 54.1902C33.14 60.8588 40.4135 60.4208 40.4135 60.4208Z"
                              fill="white"/>
                    </svg>
                    <div className={s.card__itemInfo}>
                        <p className={s.card__itemTitle}>Вконтакте</p>
                        <p className={s.card__itemDescr}>Чат бот</p>
                    </div>
                </li>
                <li className={s.card__item}>

                    <svg width="64" height="64" viewBox="0 0 84 84" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M42 84C65.196 84 84 65.196 84 42C84 18.804 65.196 0 42 0C18.804 0 0 18.804 0 42C0 65.196 18.804 84 42 84Z"
                            fill="#039BE5"/>
                        <path
                            d="M19.2184 41.09L59.7135 25.4765C61.5929 24.7975 63.2344 25.935 62.6254 28.777L62.6289 28.7735L55.7339 61.257C55.2229 63.56 53.8544 64.12 51.9399 63.035L41.4399 55.2965L36.3754 60.1755C35.8154 60.7355 35.3429 61.208 34.2579 61.208L35.0034 50.5225L54.4634 32.942C55.3104 32.1965 54.2744 31.7765 53.1579 32.5185L29.1094 47.6595L18.7424 44.4255C16.4919 43.7115 16.4429 42.175 19.2184 41.09Z"
                            fill="white"/>
                    </svg>
                    <div className={s.card__itemInfo}>
                        <p className={s.card__itemTitle}>Телеграм</p>
                        <p className={s.card__itemDescr}>Чат бот</p>
                    </div>
                </li>
                <li className={s.card__item}>

                    <svg width="64" height="64" viewBox="0 0 64 64" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                            d="M32 64C49.6731 64 64 49.6731 64 32C64 14.3269 49.6731 0 32 0C14.3269 0 0 14.3269 0 32C0 49.6731 14.3269 64 32 64Z"
                            fill="#F1F4F9"/>
                    </svg>

                    <div className={s.card__itemInfo}>
                        <p className={s.card__itemTitle}>Календарь</p>
                        <p className={s.card__itemDescr}>Онлайн расписание в вашем календаре</p>
                    </div>
                </li>
            </ul>
            <div className={s.iphone}>
                <img src={iphone} alt=""/>
            </div>
            <div className={s.honor}>
                <img src={oneplus} alt=""/>
            </div>

        </div>
    );
}

export default Chatbots;